stm32-hotspot/ST67W6X_RTP_Multicast/FSBL/Core/Inc/main.h
/* USER CODE BEGIN Header */
/**
  ******************************************************************************
  * @file           : main.h
  * @brief          : Header for main.c file.
  *                   This file contains the common defines of the application.
  ******************************************************************************
  * @attention
  *
  * Copyright (c) 2025 STMicroelectronics.
  * All rights reserved.
  *
  * This software is licensed under terms that can be found in the LICENSE file
  * in the root directory of this software component.
  * If no LICENSE file comes with this software, it is provided AS-IS.
  *
  ******************************************************************************
  */
/* USER CODE END Header */

/* Define to prevent recursive inclusion -------------------------------------*/
#ifndef __MAIN_H
#define __MAIN_H

#ifdef __cplusplus
extern "C" {
#endif

#if defined ( __ICCARM__ )
#  define CMSE_NS_CALL  __cmse_nonsecure_call
#  define CMSE_NS_ENTRY __cmse_nonsecure_entry
#else
#  define CMSE_NS_CALL  __attribute((cmse_nonsecure_call))
#  define CMSE_NS_ENTRY __attribute((cmse_nonsecure_entry))
#endif

/* Includes ------------------------------------------------------------------*/
#include "stm32n6xx_hal.h"

/* Private includes ----------------------------------------------------------*/
/* USER CODE BEGIN Includes */

/* USER CODE END Includes */

/* Exported types ------------------------------------------------------------*/
/* Function pointer declaration in non-secure*/
#if defined ( __ICCARM__ )
typedef void (CMSE_NS_CALL *funcptr)(void);
#else
typedef void CMSE_NS_CALL (*funcptr)(void);
#endif

/* typedef for non-secure callback functions */
typedef funcptr funcptr_NS;

/* USER CODE BEGIN ET */

/* USER CODE END ET */

/* Exported constants --------------------------------------------------------*/
/* USER CODE BEGIN EC */

/* USER CODE END EC */

/* Exported macro ------------------------------------------------------------*/
/* USER CODE BEGIN EM */
#define ALIGN32           __attribute__((aligned(32)))
#define IN_PSRAM          __attribute__((section(".psram_bss")))
#define IN_SRAM_UNCACHED  __attribute__((section(".uncached_bss")))

/* USER CODE END EM */

/* Exported functions prototypes ---------------------------------------------*/
void Error_Handler(void);

/* USER CODE BEGIN EFP */

/* USER CODE END EFP */

/* Private defines -----------------------------------------------------------*/
#define BOOT_Pin                  GPIO_PIN_13
#define BOOT_GPIO_Port            GPIOE
#define CHIP_EN_Pin               GPIO_PIN_10
#define CHIP_EN_GPIO_Port         GPIOE

#define LED_GREEN_Pin             GPIO_PIN_1
#define LED_GREEN_GPIO_Port       GPIOO
#define LED_RED_Pin               GPIO_PIN_10
#define LED_RED_GPIO_Port         GPIOG

#define SPI_CLK_Pin               GPIO_PIN_15
#define SPI_CLK_GPIO_Port         GPIOE
#define SPI_CS_Pin                GPIO_PIN_3
#define SPI_CS_GPIO_Port          GPIOA
#define SPI_MISO_Pin              GPIO_PIN_8
#define SPI_MISO_GPIO_Port        GPIOH
#define SPI_MOSI_Pin              GPIO_PIN_2
#define SPI_MOSI_GPIO_Port        GPIOG
#define SPI_RDY_Pin               GPIO_PIN_9
#define SPI_RDY_GPIO_Port         GPIOE

#define USER_BUTTON_Pin           GPIO_PIN_13
#define USER_BUTTON_GPIO_Port     GPIOC

// ToF
#define ToF_LPn_Pin               GPIO_PIN_5
#define ToF_LPn_GPIO_Port         GPIOQ
#define ToF_INT_Pin               GPIO_PIN_0
#define ToF_INT_GPIO_Port         GPIOQ

/* USER CODE BEGIN Private defines */

/* USER CODE END Private defines */

#ifdef __cplusplus
}
#endif

#endif /* __MAIN_H */
